[
  {
    "plant_id": 1025,
    "name": "Mango",
    "commonName": "Mango",
    "botanicalName": "Mangifera indica",
    "about": "The mango tree is a magnificent tropical evergreen that can grow up to 100 feet tall, with a dense, rounded canopy of dark green lanceolate leaves. Native to South Asia, particularly India and Myanmar, it has been cultivated for over 4,000 years and holds significant cultural and religious importance in many Asian countries. The tree produces fragrant pinkish-white flowers in large panicles during spring, which develop into the world's most popular tropical fruit.\n\nMango fruits vary widely in size, shape, color, and flavor depending on the cultivar, ranging from small oval fruits to large kidney-shaped varieties. The flesh can be fibrous or buttery smooth, with flavors spanning from intensely sweet to tangy with complex tropical notes. Rich in vitamins A, C, and E, mangoes are consumed fresh, in juices, chutneys, and various culinary preparations. The tree also provides valuable timber and has numerous applications in traditional medicine.",
    "care_instruction": "Fertilize in spring, prune after fruiting, protect from frost.",
    "sunlight": "Full Sun",
    "watering": "Deep watering once a week; more in summer",
    "soil": "Well-drained loamy soil",
    "climate": "Tropical and subtropical",
    "toxicity": "Sap may irritate skin"
  },
  {
    "plant_id": 3047,
    "name": "Guava",
    "commonName": "Guava",
    "botanicalName": "Psidium guajava",
    "about": "Guava is a small, highly adaptable tropical tree or shrub known for its delicious and nutritious fruits. The plant features attractive, copper-toned bark that peels off in thin flakes, revealing the greenish layer beneath, with opposite, oval leaves that are prominently veined. The white flowers, borne singly or in small clusters, give way to round or pear-shaped fruits with green skin that may turn yellow when ripe, containing pink, white, or yellow flesh embedded with numerous small, hard seeds.\n\nThis hardy plant is remarkably resilient and can thrive in various soil conditions, making it an excellent choice for home gardens. Guava fruits are exceptionally rich in vitamin C, containing four times more than oranges, and are also packed with dietary fiber, antioxidants, and essential minerals. The leaves have medicinal properties and are used in traditional remedies for various ailments, while the fruits are enjoyed fresh, in juices, jams, and desserts throughout tropical regions worldwide.",
    "care_instruction": "Prune yearly, fertilize lightly, protect from pests.",
    "sunlight": "Full Sun",
    "watering": "Regular watering; allow soil to slightly dry between sessions",
    "soil": "Sandy loam",
    "climate": "Tropical to warm temperate",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 5189,
    "name": "Banana",
    "commonName": "Banana Plant",
    "botanicalName": "Musa acuminata",
    "about": "Despite its tree-like appearance, the banana plant is actually a giant herbaceous perennial that grows from an underground rhizome. It forms a pseudostem composed of tightly wrapped leaf sheaths that can reach 20-25 feet in height, with enormous paddle-shaped leaves that unfurl from the center. The plant produces a single flowering stalk that emerges from the center, developing into a large hanging inflorescence with multiple hands of bananas protected by purple bracts.\n\nBanana plants are fast-growing and typically fruit within 10-15 months of planting. After fruiting, the main stem dies back and is replaced by new suckers from the base. The fruits develop parthenocarpically without pollination, growing in curved clusters that can contain 50-150 individual bananas. Rich in potassium, vitamin B6, and dietary fiber, bananas are one of the world's most important food crops, serving as a staple food in many tropical countries and being exported globally for fresh consumption and processing.",
    "care_instruction": "Add organic compost, remove suckers, protect from strong winds.",
    "sunlight": "Full Sun",
    "watering": "Frequent; keep soil moist",
    "soil": "Rich, well-drained soil",
    "climate": "Hot, humid tropical climate",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 6231,
    "name": "Papaya",
    "commonName": "Papaya",
    "botanicalName": "Carica papaya",
    "about": "Papaya is a fast-growing, short-lived perennial plant with a single, unbranched stem that can reach 20-30 feet in height, crowned by a canopy of large, deeply lobed palmate leaves on long petioles. The leaves are arranged spirally and can measure up to 2 feet across, creating an umbrella-like appearance. The plant is typically dioecious, with male and female flowers on separate plants, though some hermaphrodite varieties exist that can self-pollinate.\n\nThe oval or pear-shaped fruits grow directly from the main stem and can weigh up to 20 pounds, though most commercial varieties are smaller. The thin skin turns from green to orange-yellow when ripe, revealing sweet, juicy orange or pink flesh with a central cavity filled with black seeds. Papaya contains papain, a proteolytic enzyme that aids digestion and is used as a meat tenderizer. The fruits are rich in vitamins C and A, folate, and antioxidants, making them both nutritious and medicinal.",
    "care_instruction": "Avoid waterlogging, fertilize monthly, protect from high winds.",
    "sunlight": "Full Sun",
    "watering": "Moderate; water when soil dries slightly",
    "soil": "Light, well-drained soil",
    "climate": "Tropical",
    "toxicity": "Latex may cause allergies"
  },
  {
    "plant_id": 7456,
    "name": "Lemon",
    "commonName": "Lemon",
    "botanicalName": "Citrus limon",
    "about": "The lemon tree is a small evergreen tree that typically grows 10-20 feet tall, with glossy, elliptical leaves that have a distinct citrus aroma when crushed. The branches often bear sharp thorns, and the tree produces fragrant white or pink-tinged flowers that can appear throughout the year in suitable climates. These flowers develop into the familiar oval yellow fruits, which take several months to ripen from green to bright yellow.\n\nLemon trees are highly productive and can bear fruit year-round in tropical climates, with peak production typically in winter and spring in subtropical regions. The fruits contain high levels of vitamin C, citric acid, and various phytochemicals that give them their characteristic sour taste and preservative qualities. Lemons have countless culinary uses in beverages, cooking, baking, and preserving, while also serving household cleaning purposes. The essential oils extracted from lemon peel are used in aromatherapy, cosmetics, and as natural fragrances.",
    "care_instruction": "Prune lightly, fertilize 3 times yearly, treat scale insects.",
    "sunlight": "Full Sun",
    "watering": "Moderate; avoid soggy roots",
    "soil": "Slightly acidic well-drained soil",
    "climate": "Tropical, subtropical",
    "toxicity": "Leaves may irritate pets"
  },
  {
    "plant_id": 8892,
    "name": "Neem",
    "commonName": "Neem Tree",
    "botanicalName": "Azadirachta indica",
    "about": "Neem is a fast-growing evergreen tree that can reach 50-65 feet in height, with a wide-spreading canopy that provides excellent shade in hot climates. The tree features compound leaves with numerous small, serrated leaflets that remain green throughout the year. In spring, it produces abundant small, white, fragrant flowers in axillary clusters, which develop into olive-like fruits containing a single seed. The tree is remarkably drought-resistant once established and can thrive in poor soil conditions.\n\nOften called 'the village pharmacy' in India, neem has been used in Ayurvedic medicine for over 4,000 years. Every part of the tree - leaves, bark, seeds, and flowers - contains compounds with medicinal properties, particularly azadirachtin, which has insecticidal, antifungal, and antibacterial qualities. Neem oil extracted from the seeds is widely used in organic farming, cosmetics, and traditional remedies. The tree also helps improve soil fertility and is valued for its air-purifying capabilities in urban environments.",
    "care_instruction": "Minimal care; prune to shape; drought-tolerant.",
    "sunlight": "Full Sun",
    "watering": "Low; occasional deep watering",
    "soil": "Any well-drained soil",
    "climate": "Tropical, dry regions",
    "toxicity": "Neem oil may be toxic if ingested"
  },
  {
    "plant_id": 9123,
    "name": "Banyan",
    "commonName": "Banyan Tree",
    "botanicalName": "Ficus benghalensis",
    "about": "The banyan tree is one of the world's most magnificent and massive trees, famous for its unique growth habit of producing aerial roots from its branches. These roots grow downward into the soil, where they thicken into woody pillars that support the ever-expanding canopy, eventually forming what appears to be a grove of multiple trees. A single mature banyan can spread over several acres, with the largest specimens covering areas equivalent to city blocks. The tree has large, leathery, elliptical leaves and produces small fig-like fruits that are popular with birds and bats.\n\nIn Hindu mythology, the banyan tree represents eternal life due to its seemingly endless expansion, and it is considered sacred throughout the Indian subcontinent. These trees often serve as natural community centers in villages, providing shade for gatherings, markets, and religious ceremonies. The complex structure of mature banyans creates unique microhabitats that support diverse ecosystems of birds, insects, and small mammals. Some famous banyan trees are centuries old and have become major tourist attractions due to their immense size and architectural beauty.",
    "care_instruction": "Requires space; prune aerial roots; avoid overwatering.",
    "sunlight": "Full Sun",
    "watering": "Light; drought-tolerant once mature",
    "soil": "Loamy soil",
    "climate": "Tropical to subtropical",
    "toxicity": "Sap may irritate skin"
  },
  {
    "plant_id": 1047,
    "name": "Ashoka",
    "commonName": "Ashoka Tree",
    "botanicalName": "Saraca asoca",
    "about": "The Ashoka tree is a small, elegant evergreen that grows 20-30 feet tall, with a dense, symmetrical canopy of dark green, lance-shaped leaves that hang gracefully from drooping branches. The tree is most celebrated for its stunning floral display - dense clusters of bright orange-red flowers that emerge directly from the branches and trunk in a phenomenon known as cauliflory. Each flower cluster resembles a fluffy pom-pom, with numerous long-stamened blossoms that lack true petals but feature colorful sepals that create the floral display.\n\nIn Indian culture, the Ashoka tree holds deep spiritual significance and is mentioned in ancient texts like the Ramayana. The name 'Ashoka' means 'sorrow-less' in Sanskrit, reflecting the belief that the tree has the power to relieve sorrow and bring joy. The flowers are used in temple decorations and religious ceremonies, while the bark has medicinal properties used in traditional remedies for various women's health issues. The tree prefers shaded, moist locations and makes an excellent ornamental specimen for gardens and parks in tropical regions.",
    "care_instruction": "Mulch in summer, prune lightly, keep soil moist.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Moist, well-drained soil",
    "climate": "Humid tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 2158,
    "name": "Tulsi",
    "commonName": "Holy Basil",
    "botanicalName": "Ocimum tenuiflorum",
    "about": "Tulsi, or Holy Basil, is a fragrant perennial herb that grows as a small bush reaching 1-2 feet in height, with hairy stems and green or purple leaves depending on the variety. The leaves are oval with slightly toothed margins and contain numerous oil glands that release a characteristic spicy aroma when crushed. Small purple or white flowers appear in whorls on elongated spikes, attracting bees and other pollinators. The plant has a strong religious significance in Hinduism and is often grown in courtyard gardens or in special Tulsi pots for daily worship.\n\nConsidered an adaptogen in Ayurvedic medicine, Tulsi has been used for thousands of years to promote health and longevity. The leaves contain essential oils rich in eugenol, rosmarinic acid, and various antioxidants that provide anti-inflammatory, antimicrobial, and immune-boosting properties. Tulsi tea made from the fresh or dried leaves is popular for relieving stress, improving respiratory health, and supporting overall wellness. The plant is also valued in organic gardening for its pest-repelling qualities and is used in traditional home remedies for common ailments.",
    "care_instruction": "Pinch flowers to promote leaves, apply compost monthly.",
    "sunlight": "Full Sun",
    "watering": "Light; water when topsoil dries",
    "soil": "Well-drained loam",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 3269,
    "name": "Aloe Vera",
    "commonName": "Aloe",
    "botanicalName": "Aloe barbadensis miller",
    "about": "Aloe vera is a stemless or short-stemmed succulent that forms rosettes of thick, fleshy leaves that can grow up to 2 feet long. The leaves are green to gray-green in color, with some varieties showing white spots on the surface, and have serrated edges with small white teeth. Inside the leaves is the valuable clear gel containing 99% water and a complex mixture of vitamins, enzymes, minerals, sugars, anthraquinones, and amino acids that give the plant its medicinal properties. The plant produces yellow tubular flowers on tall spikes that emerge from the center of the rosette.\n\nThis remarkable plant has been used medicinally for over 6,000 years, with records of its healing properties found in ancient Egyptian, Greek, Roman, Indian, and Chinese texts. The gel is most famous for treating burns, wounds, and skin irritations due to its cooling, moisturizing, and anti-inflammatory effects. Modern research has confirmed its benefits for skin health, digestive issues, and immune support. Aloe vera is also an excellent air-purifying plant that removes formaldehyde and benzene from indoor environments, making it popular for homes and offices.",
    "care_instruction": "Avoid overwatering, allow soil to dry completely.",
    "sunlight": "Bright Indirect Sun",
    "watering": "Low; once every 10–14 days",
    "soil": "Sandy, fast-draining soil",
    "climate": "Arid, semi-arid",
    "toxicity": "Toxic to pets if eaten"
  },
  {
    "plant_id": 4370,
    "name": "Snake Plant",
    "commonName": "Snake Plant",
    "botanicalName": "Sansevieria trifasciata",
    "about": "The snake plant, also known as mother-in-law's tongue, is an extremely hardy succulent characterized by its upright, sword-shaped leaves that emerge from underground rhizomes. The stiff, leathery leaves are typically dark green with cross-banding of lighter green or gray, and some varieties feature yellow or white margins. The leaves can grow 2-4 feet tall indoors, forming dense clumps that make excellent architectural accent plants. This plant is renowned for its ability to survive in low-light conditions and with minimal care, making it ideal for beginners and challenging indoor environments.\n\nNASA's Clean Air Study identified snake plants as excellent air purifiers that remove toxins like formaldehyde, xylene, toluene, and nitrogen oxides from indoor air. Unlike most plants, snake plants continue photosynthesizing and releasing oxygen at night, making them ideal for bedrooms to improve air quality during sleep. The plant's durability comes from its Crassulacean Acid Metabolism (CAM) photosynthesis, which allows it to keep its stomata closed during the day to reduce water loss. In addition to its air-purifying qualities, snake plants have been used in traditional African medicine to treat earaches, intestinal problems, and skin conditions.",
    "care_instruction": "Avoid overwatering, wipe leaves monthly.",
    "sunlight": "Low to Bright Indirect",
    "watering": "Once every 2–3 weeks",
    "soil": "Well-drained cactus mix",
    "climate": "Indoor, dry climates",
    "toxicity": "Toxic to pets"
  },
  {
    "plant_id": 5481,
    "name": "Areca Palm",
    "commonName": "Areca Palm",
    "botanicalName": "Dypsis lutescens",
    "about": "The Areca Palm, also known as the Butterfly Palm, is a graceful, clustering palm that features multiple golden-green stems and elegant, arching fronds with numerous slender leaflets. Each stem is ringed with leaf scars that create a bamboo-like appearance, growing up to 20-30 feet tall in outdoor settings but typically remaining around 6-7 feet when grown indoors. The fronds can reach 6-8 feet in length, creating a feathery, tropical appearance that brings a sense of lushness to any space. Small yellow flowers may appear in summer, followed by tiny purple fruits, though indoor specimens rarely flower.\n\nThis palm is renowned as one of the most effective air-purifying plants, capable of removing toxins like formaldehyde, xylene, and toluene from indoor environments. In its native Madagascar, it grows in humid, tropical forests but has adapted well to indoor conditions worldwide. The Areca Palm is particularly valued for its ability to add humidity to dry indoor air through transpiration, making it beneficial in air-conditioned spaces. Its non-toxic nature also makes it safe for homes with pets and children, contributing to its popularity as a decorative and functional houseplant.",
    "care_instruction": "Mist leaves occasionally, avoid direct harsh sun.",
    "sunlight": "Bright Indirect",
    "watering": "Moderate; keep soil slightly moist",
    "soil": "Rich, well-drained soil",
    "climate": "Warm, humid",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 6592,
    "name": "Money Plant",
    "commonName": "Pothos",
    "botanicalName": "Epipremnum aureum",
    "about": "Money Plant, commonly known as Pothos or Devil's Ivy, is a vigorous trailing vine with heart-shaped leaves that feature striking marbling in shades of green, yellow, or white depending on the variety. The leaves are waxy and leathery, growing alternately along the stems which can reach lengths of 10 feet or more when provided with support. This plant is particularly notable for its ability to grow in both soil and water, developing extensive root systems that allow it to adapt to various growing conditions. In its natural habitat, it climbs tree trunks using aerial roots, but it thrives equally well as a hanging basket plant indoors.\n\nAccording to Feng Shui principles, the Money Plant is believed to bring prosperity, good luck, and positive energy to homes and workplaces. NASA's Clean Air Study identified it as an excellent air purifier that effectively removes common indoor pollutants like formaldehyde, benzene, and carbon monoxide. The plant is incredibly low-maintenance and can survive in low-light conditions that would challenge most other houseplants. Its rapid growth and easy propagation through stem cuttings make it a favorite among beginner gardeners and those looking to quickly green up their living spaces with minimal effort.",
    "care_instruction": "Trim vines, refresh water if grown hydroponically.",
    "sunlight": "Low to Medium Light",
    "watering": "Once a week",
    "soil": "Well-drained potting mix",
    "climate": "Indoor",
    "toxicity": "Toxic to pets"
  },
  {
    "plant_id": 7603,
    "name": "Rose",
    "commonName": "Rose",
    "botanicalName": "Rosa spp.",
    "about": "Roses are woody perennial flowering plants characterized by their thorny stems and beautiful, often fragrant flowers that come in virtually every color except true blue. The plants can take various forms including shrubs, climbers, and ground covers, with compound leaves typically having 5-7 leaflets with serrated edges. Rose flowers feature multiple layers of delicate petals arranged around a central core of reproductive structures, with bloom sizes ranging from tiny miniatures to large, exhibition-quality blooms measuring several inches across. Most varieties bloom repeatedly throughout the growing season, providing continuous color from spring until frost.\n\nWith a cultivation history dating back over 5,000 years, roses hold significant cultural importance across civilizations, symbolizing love, beauty, war, and politics in different contexts. Beyond their ornamental value, roses have numerous practical uses: rose hips are rich in vitamin C and used in teas and jams, rose water is valued in cooking and cosmetics, and rose essential oil is one of the most expensive in the world for perfumery. The flowers are also edible and used to garnish salads and desserts, while in traditional medicine, rose preparations have been used to treat everything from digestive issues to skin conditions and emotional distress.",
    "care_instruction": "Deadhead flowers, fertilize monthly, monitor pests.",
    "sunlight": "Full Sun",
    "watering": "Every 2–3 days",
    "soil": "Loamy, nutrient-rich",
    "climate": "Temperate",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 8714,
    "name": "Marigold",
    "commonName": "Marigold",
    "botanicalName": "Tagetes erecta",
    "about": "Marigolds are cheerful annual flowers known for their vibrant yellow, orange, and red blooms that brighten gardens from spring through fall. The plants feature fern-like, aromatic leaves that emit a distinctive pungent scent when crushed, which helps deter many garden pests. There are two main types: African marigolds with large, pom-pom flowers on tall stems, and French marigolds with smaller flowers and more compact growth habits. The flowers are actually composite inflorescences consisting of numerous tiny florets arranged in dense heads, with ray florets forming the showy petals and disc florets in the center.\n\nIn Indian culture, marigolds hold deep religious and ceremonial significance, extensively used in weddings, festivals, and temple decorations. The flowers are edible and used as a natural food coloring and garnish, while also containing compounds with medicinal properties including antioxidant, anti-inflammatory, and antimicrobial effects. Marigolds are valuable companion plants in vegetable gardens, as their root secretions help control nematodes and their scent repels whiteflies, aphids, and other pests. The flowers are also used to make natural dyes for fabrics and in traditional remedies for skin conditions, wounds, and eye infections.",
    "care_instruction": "Pinch early buds, fertilize lightly.",
    "sunlight": "Full Sun",
    "watering": "Moderate; avoid overwatering",
    "soil": "Well-drained soil",
    "climate": "Tropical to warm temperate",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 9825,
    "name": "Sunflower",
    "commonName": "Sunflower",
    "botanicalName": "Helianthus annuus",
    "about": "Sunflowers are iconic annual plants famous for their massive, daisy-like flower heads that can reach over 12 inches in diameter in some varieties. The plants feature coarse, hairy stems and large, heart-shaped leaves that alternate along the stem, with most varieties growing 5-12 feet tall, though dwarf cultivars remain under 3 feet. The flower heads consist of thousands of tiny disc florets in the center surrounded by bright yellow ray florets, creating the characteristic sun-like appearance. Sunflowers exhibit heliotropism, meaning the young flower heads track the sun's movement across the sky each day.\n\nBeyond their ornamental value, sunflowers are important agricultural crops grown for their edible seeds, which are rich in healthy fats, protein, vitamin E, and various minerals. The seeds are consumed raw, roasted, or pressed to extract sunflower oil, which is widely used in cooking and cosmetics. Sunflowers are also used in phytoremediation to extract toxic heavy metals from contaminated soil, and the stalks can be processed into paper or building materials. The plants support biodiversity by providing nectar for pollinators and seeds for birds, while sunflower meal leftover from oil extraction serves as nutritious livestock feed.",
    "care_instruction": "Provide support, fertilize during flowering.",
    "sunlight": "Full Sun",
    "watering": "Regular watering",
    "soil": "Loamy, well-drained",
    "climate": "Warm climates",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 1936,
    "name": "Spinach",
    "commonName": "Spinach",
    "botanicalName": "Spinacia oleracea",
    "about": "Spinach is a leafy green annual vegetable that forms a rosette of dark green, tender leaves that can be smooth, savoyed (crinkled), or semi-savoyed depending on the variety. The plant grows 6-12 inches tall and develops a deep taproot that helps it access moisture and nutrients from lower soil layers. Spinach is a cool-season crop that bolts quickly in warm weather, sending up a central flower stalk with small, greenish flowers that eventually produce seed clusters. The leaves are rich in chlorophyll, giving them their vibrant green color, and contain high levels of vitamins, minerals, and beneficial phytochemicals.\n\nThis nutritional powerhouse is exceptionally rich in iron, calcium, magnesium, potassium, and vitamins A, C, and K, making it one of the most nutrient-dense foods available. Regular consumption supports bone health, improves blood pressure, enhances eye health due to its lutein and zeaxanthin content, and provides anti-inflammatory benefits. Spinach contains oxalic acid which can inhibit mineral absorption, but cooking reduces this effect while making other nutrients more available. The leaves are versatile in culinary uses, enjoyed raw in salads, lightly steamed, sautéed, or added to soups, stews, and smoothies for a nutritional boost.",
    "care_instruction": "Harvest frequently, keep soil moist.",
    "sunlight": "Partial Shade",
    "watering": "Regular",
    "soil": "Fertile, moist soil",
    "climate": "Cool-season",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 2847,
    "name": "Tomato",
    "commonName": "Tomato",
    "botanicalName": "Solanum lycopersicum",
    "about": "Tomatoes are herbaceous perennial plants typically grown as annuals, featuring hairy stems with a strong, distinctive odor and compound leaves divided into multiple leaflets with serrated edges. The plants can be determinate (bush-type) that grow to a certain height and fruit all at once, or indeterminate (vining-type) that continue growing and fruiting until killed by frost. Small yellow flowers develop into fruits that range from tiny cherry tomatoes to large beefsteak varieties, in colors including red, yellow, orange, green, purple, and even striped patterns. The plants produce suckers at leaf axils that can be removed to control growth and direct energy to fruit production.\n\nBotanically classified as berries, tomatoes are among the world's most popular garden vegetables and are incredibly versatile in culinary applications, used fresh in salads, cooked in sauces, soups, and stews, or processed into paste, juice, and ketchup. They are rich in lycopene, a powerful antioxidant linked to reduced risk of certain cancers and heart disease, along with vitamins C and K, potassium, and folate. Tomatoes were originally domesticated in Central America and were viewed with suspicion when introduced to Europe, believed to be poisonous like their nightshade relatives. Today, thousands of cultivars exist worldwide, adapted to various growing conditions and culinary preferences.",
    "care_instruction": "Provide stakes, fertilize during fruiting.",
    "sunlight": "Full Sun",
    "watering": "Regular; keep soil moist",
    "soil": "Nutrient-rich loam",
    "climate": "Warm-season",
    "toxicity": "Leaves are toxic"
  },
  {
    "plant_id": 3758,
    "name": "Coriander",
    "commonName": "Coriander",
    "botanicalName": "Coriandrum sativum",
    "about": "Coriander is a fast-growing annual herb that features two distinct types of leaves: the lower leaves are broad and lobed, resembling parsley, while the upper leaves are feathery and finely divided. The plant grows 1-2 feet tall and produces small white or pale pink flowers in umbrella-shaped clusters that attract beneficial insects like hoverflies and parasitic wasps. After flowering, it develops round, ribbed seeds that turn from green to beige as they mature. Both the leaves (known as cilantro) and seeds are used culinarily, though they have remarkably different flavors and applications.\n\nThis dual-purpose herb is integral to cuisines worldwide, particularly in Mexican, Indian, Middle Eastern, and Southeast Asian cooking. The fresh leaves have a bright, citrusy flavor that enhances salsas, curries, and salads, while the dried seeds offer a warm, aromatic, slightly citrusy note ideal for spice blends, pickling, and baking. Coriander has significant medicinal properties, aiding digestion, reducing bloating, and having antimicrobial effects. The essential oil is used in perfumery and traditional medicine, while genetic factors cause some people to perceive the leaves as having a soapy taste due to sensitivity to specific aldehydes in the plant.",
    "care_instruction": "Sow frequently, keep soil moist, harvest young leaves.",
    "sunlight": "Full Sun to Partial Shade",
    "watering": "Moderate",
    "soil": "Well-drained fertile soil",
    "climate": "Cool-season",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 4669,
    "name": "Curry Leaf Plant",
    "commonName": "Curry Leaves",
    "botanicalName": "Murraya koenigii",
    "about": "The Curry Leaf Plant is a small, tropical to subtropical tree or shrub that typically grows 10-20 feet tall, with a slender trunk and multiple branches forming a dense, attractive canopy. The plant features pinnate leaves with 11-21 small, shiny, dark green leaflets arranged alternately along the stem, which release a strong, aromatic fragrance when crushed. Small, fragrant white flowers appear in clusters, developing into small, shiny black berries that contain single seeds. The plant is evergreen in frost-free climates but may become deciduous in cooler temperatures or during drought conditions.\n\nEssential to South Indian and Sri Lankan cuisines, curry leaves impart a distinctive flavor described as citrusy with notes of anise and lemongrass, fundamentally different from curry powder. The leaves are typically tempered in hot oil at the beginning of cooking to release their flavor before being added to dals, curries, chutneys, and rice dishes. In Ayurvedic medicine, curry leaves are valued for their digestive, anti-diabetic, and cholesterol-lowering properties, while also being rich in antioxidants, vitamins A and C, calcium, and iron. The leaves are rarely eaten whole but are used to infuse dishes with flavor before being removed, similar to bay leaves in Western cooking.",
    "care_instruction": "Prune regularly, fertilize with nitrogen-rich food.",
    "sunlight": "Full Sun",
    "watering": "Moderate; allow soil to dry slightly",
    "soil": "Well-drained sandy loam",
    "climate": "Tropical, warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 5570,
    "name": "Jackfruit",
    "commonName": "Jackfruit",
    "botanicalName": "Artocarpus heterophyllus",
    "about": "Jackfruit is a massive tropical evergreen tree that can reach 30-70 feet tall, with a straight trunk and dense, dark green canopy of glossy, leathery leaves that are oval-shaped and 4-8 inches long. The tree produces the largest tree-borne fruits in the world, with individual fruits weighing 10-100 pounds and measuring up to 3 feet long and 20 inches in diameter. The fruits have a rough, greenish-yellow rind covered in blunt spikes and contain numerous yellow, fleshy bulbs surrounding large seeds, all encased in a fibrous core. When ripe, the fruit emits a strong, sweet aroma that some find unpleasant but indicates perfect ripeness.\n\nThis remarkable fruit has gained global attention as a plant-based meat alternative due to its texture when unripe, which resembles pulled pork or chicken when cooked. The ripe fruit has a sweet, tropical flavor reminiscent of pineapple, banana, and mango, enjoyed fresh or in desserts, while the seeds are edible when roasted or boiled. Jackfruit is highly nutritious, rich in vitamin C, potassium, dietary fiber, and various antioxidants. In its native range of South and Southeast Asia, nearly every part of the tree is used: the wood for furniture and musical instruments, the leaves as animal fodder, and the latex as adhesive, making it an exceptionally valuable multipurpose tree.",
    "care_instruction": "Mulch heavily, prune after harvest, protect from frost.",
    "sunlight": "Full Sun",
    "watering": "Moderate; deep watering",
    "soil": "Rich, well-drained soil",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 6481,
    "name": "Coconut Palm",
    "commonName": "Coconut Tree",
    "botanicalName": "Cocos nucifera",
    "about": "The Coconut Palm is a majestic, single-stemmed palm tree that can grow 50-100 feet tall, with a slender, often gracefully curved trunk marked by ring-like leaf scars. The tree features a crown of 20-30 giant, pinnate leaves that can reach 15-17 feet long, with numerous leaflets arranged on either side of the leaf stem. Each leaf remains on the tree for 2-3 years before falling cleanly, leaving the characteristic ring on the trunk. The tree produces large flower clusters that develop into the familiar coconuts, which take about a year to mature through various stages from green to brown.\n\nOften called the 'Tree of Life' in tropical regions, coconuts provide food, drink, shelter, and materials for countless uses. The water from young coconuts is a sterile, nutritious beverage rich in electrolytes, while the mature flesh is eaten fresh, dried as copra for oil extraction, or processed into milk and cream. Coconut oil is valued for cooking and cosmetics, the husk fibers make coir for ropes and mats, and the leaves are used for thatching and weaving. This salt-tolerant palm typically grows near coastlines and has spread throughout the tropics by floating coconuts that can survive months at sea, eventually washing ashore to germinate in new locations.",
    "care_instruction": "Avoid waterlogging, provide seaweed fertilizer.",
    "sunlight": "Full Sun",
    "watering": "Low to moderate",
    "soil": "Sandy, well-drained soil",
    "climate": "Tropical coastal",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 7392,
    "name": "Pomegranate",
    "commonName": "Pomegranate",
    "botanicalName": "Punica granatum",
    "about": "The Pomegranate is a small, deciduous tree or large shrub that typically grows 12-20 feet tall, with multiple slender, often spiny branches and narrow, glossy leaves that are bronze when young, turning bright green, then yellow in autumn. The plant produces striking orange-red flowers with crumpled petals that resemble carnations, followed by large, rounded fruits with a distinctive crown-like calyx at the base. The fruits have leathery skin that ranges from pinkish-yellow to deep red, containing hundreds of juicy arils (seed sacs) separated by bitter white membranes. Pomegranates are long-lived plants that can remain productive for several decades with proper care.\n\nPomegranates have deep cultural and religious significance across many civilizations, symbolizing fertility, abundance, and eternal life in various mythologies and religious texts. The jewel-like arils are rich in vitamin C, vitamin K, potassium, and powerful antioxidants called punicalagins that have demonstrated anti-inflammatory and heart-protective effects in scientific studies. The juice, seeds, and even peel are used in traditional medicine to treat various ailments, while modern research investigates its potential anti-cancer properties. Pomegranates are drought-tolerant once established and can thrive in semi-arid climates, making them valuable crops in regions with limited water resources.",
    "care_instruction": "Prune lightly, use compost in spring.",
    "sunlight": "Full Sun",
    "watering": "Low to moderate; drought-tolerant",
    "soil": "Loamy soil",
    "climate": "Semi-arid to tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 8203,
    "name": "Apple",
    "commonName": "Apple Tree",
    "botanicalName": "Malus domestica",
    "about": "Apple trees are deciduous trees that typically grow 10-30 feet tall, with a rounded canopy of oval, pointed leaves with serrated edges that turn yellow in autumn before falling. The trees produce beautiful pinkish-white flowers in spring that develop into the familiar fruits, which vary enormously in size, color, flavor, and texture depending on the cultivar. Apple trees require cross-pollination from a different variety to produce fruit, making them dependent on insects, particularly bees, for successful fertilization. The trees have a natural biennial bearing tendency, producing a heavy crop one year followed by a light crop the next, though this can be managed through proper pruning and thinning.\n\nApples are among the most widely cultivated fruit trees globally, with thousands of varieties developed for fresh eating, cooking, cider production, and long-term storage. They are rich in dietary fiber, vitamin C, and various antioxidants, with the saying 'an apple a day keeps the doctor away' reflecting their health-promoting reputation. The fruit's genetic diversity means different varieties thrive in various climates, from cold-hardy types that withstand freezing winters to low-chill varieties suitable for subtropical regions. Apples have significant cultural importance in many societies, featuring prominently in mythology, folklore, and religious stories, while apple orchards provide valuable habitats for wildlife and contribute to agricultural biodiversity.",
    "care_instruction": "Winter pruning, use fungicide against scab.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Fertile, well-drained",
    "climate": "Cool temperate",
    "toxicity": "Seeds contain small amounts of cyanide"
  },
  {
    "plant_id": 9114,
    "name": "Peach",
    "commonName": "Peach",
    "botanicalName": "Prunus persica",
    "about": "Peach trees are small deciduous trees growing 15-25 feet tall, with lance-shaped leaves and attractive pink flowers that appear in early spring before the leaves emerge. The trees have a spreading growth habit and relatively short lifespan of 15-20 years, though they begin fruiting within 2-4 years of planting. The fruits are drupes with a characteristic fuzzy skin that can be yellow, white, or red, surrounding juicy flesh that clings to the stone (clingstone) or separates easily (freestone). Peach flowers are particularly vulnerable to late spring frosts, which can destroy the crop in susceptible regions.\n\nPeaches are categorized as either melting flesh types that become soft and juicy when ripe, or non-melting types with firmer flesh better suited for canning and shipping. They are rich in vitamins A and C, potassium, and antioxidants, while also containing amygdalin in the pits which breaks down into cyanide when crushed. The nectarine is a natural mutation of peach with smooth skin rather than fuzzy, both belonging to the same species. Peach cultivation dates back thousands of years in China, where the fruit symbolizes immortality and friendship, and features prominently in art, literature, and cultural traditions. Modern breeding has developed low-chill varieties that enable peach cultivation in warmer climates previously unsuitable for this traditionally temperate fruit.",
    "care_instruction": "Prune annually to shape, protect from pests.",
    "sunlight": "Full Sun",
    "watering": "Moderate; consistent moisture",
    "soil": "Sandy loam",
    "climate": "Temperate",
    "toxicity": "Leaves and pits toxic to pets"
  },
  {
    "plant_id": 1026,
    "name": "Chiku",
    "commonName": "Sapodilla",
    "botanicalName": "Manilkara zapota",
    "about": "The Sapodilla tree is a handsome, slow-growing evergreen that can reach 30-50 feet tall in ideal conditions, with a dense canopy of glossy, elliptical leaves that are dark green on top and lighter beneath. The tree produces small, bell-shaped white flowers that are inconspicuous but develop into round or oval fruits with rough, brown skin resembling potatoes. When ripe, the fruit has exceptionally sweet, granular flesh that ranges from yellow to earthy brown, with a flavor often described as a combination of pear, brown sugar, and caramel. The tree contains a milky latex in all parts, which was historically the source of chicle, the original base for chewing gum.\n\nSapodilla trees are remarkably resilient, tolerating various soil types, drought, and salt spray, making them excellent for coastal plantings in tropical regions. The fruits are typically eaten fresh when fully ripe, as unripe fruits contain tannins that make them unpalatably astringent and can cause mouth irritation. Rich in dietary fiber, vitamins A and C, and various minerals, sapodillas are not only delicious but also aid digestion and provide antioxidant benefits. The wood is hard, durable, and termite-resistant, valued for construction, furniture, and tool handles, while the latex is still used in some natural chewing gums and as an adhesive.",
    "care_instruction": "Fertilize twice a year, prune lightly.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Well-drained soil",
    "climate": "Tropical, warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 2137,
    "name": "Custard Apple",
    "commonName": "Sitaphal",
    "botanicalName": "Annona squamosa",
    "about": "The Custard Apple tree is a small, semi-deciduous tree growing 10-20 feet tall, with slender branches and oblong leaves that are pale green on top and bluish-green beneath. The tree produces unusual greenish-yellow flowers that hang singly or in small clusters, developing into heart-shaped or oval fruits with a distinctive knobby surface formed by overlapping carpel sections. The fruit has thin, pale green skin that turns brownish when ripe, revealing creamy white flesh with a texture similar to custard and embedded with numerous dark brown seeds. The flavor is exceptionally sweet with notes of vanilla, pineapple, and strawberry, making it a popular dessert fruit in tropical regions.\n\nThis fruit is highly nutritious, rich in vitamin C, B vitamins, potassium, and magnesium, while also containing beneficial antioxidants and anti-inflammatory compounds. In traditional medicine, various parts of the plant are used to treat diarrhea, dysentery, arthritis, and skin conditions, though the seeds are toxic and should not be consumed. The tree is relatively drought-tolerant once established and can produce fruit within 3-4 years of planting. Custard apples are typically eaten fresh by scooping out the flesh, but are also used in milkshakes, ice creams, and desserts, though the seeds must be carefully removed due to their toxicity.",
    "care_instruction": "Prune after fruiting, fertilize with organic compost.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Sandy or loamy soil",
    "climate": "Tropical, dry",
    "toxicity": "Seeds are toxic"
  },
  {
    "plant_id": 3248,
    "name": "Black Pepper",
    "commonName": "Pepper Vine",
    "botanicalName": "Piper nigrum",
    "about": "Black Pepper is a perennial woody vine that can climb 10-15 feet high when provided with support, featuring heart-shaped, dark green leaves with prominent veins and aerial roots that help it cling to supports. The plant produces pendulous flower spikes 3-6 inches long that develop into chains of small, spherical fruits called drupes. These fruits undergo remarkable transformations: green when immature, they turn red when ripe, and different processing methods produce black, white, green, and red peppercorns from the same fruit. The vines begin producing 3-4 years after planting and can remain productive for 20-30 years with proper care.\n\nKnown as the 'King of Spices,' black pepper has been one of the most important and valuable trade commodities throughout history, driving exploration and shaping global trade routes. Black peppercorns are produced by harvesting unripe green fruits and drying them until they shrivel and turn black, while white pepper comes from ripe fruits with the outer skin removed, resulting in a milder flavor. Green peppercorns are preserved unripe fruits, and red peppercorns are ripe fruits preserved in brine or freeze-dried. Piperine, the compound responsible for pepper's pungency, enhances nutrient absorption and has demonstrated anti-inflammatory and antioxidant properties in scientific studies.",
    "care_instruction": "Provide support pole, prevent root rot.",
    "sunlight": "Partial Shade",
    "watering": "Moderate; keep moist",
    "soil": "Well-drained fertile soil",
    "climate": "Humid tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 4359,
    "name": "Ginger",
    "commonName": "Ginger",
    "botanicalName": "Zingiber officinale",
    "about": "Ginger is a herbaceous perennial that grows from a thick, branching rhizome (commonly called ginger root) with erect, reed-like stems reaching 2-4 feet tall. The plant features narrow, lance-shaped leaves arranged in two ranks along the stems, with a tropical appearance similar to bamboo or corn plants. Ginger produces cone-shaped inflorescences with greenish-yellow flowers edged in purple, though it rarely flowers in cultivation. The rhizomes grow horizontally just below the soil surface, developing a knobby, beige skin with pale yellow to amber flesh inside, containing the characteristic pungent, aromatic compounds.\n\nOne of the world's oldest and most important spices, ginger has been used for both culinary and medicinal purposes for over 5,000 years. The primary active compounds, gingerols and shogaols, are responsible for its distinctive flavor and numerous health benefits, including anti-nausea, anti-inflammatory, and antioxidant effects. Ginger is fundamental to Asian cuisines, particularly Indian, Chinese, Japanese, and Thai, and is used fresh, dried, powdered, candied, or preserved in various culinary applications. In traditional medicine systems worldwide, ginger is employed to treat digestive issues, respiratory conditions, arthritis, and menstrual discomfort, with modern research confirming many of these traditional uses.",
    "care_instruction": "Mulch heavily, avoid direct harsh sun.",
    "sunlight": "Partial Shade",
    "watering": "Regular; keep moist",
    "soil": "Loose, rich soil",
    "climate": "Humid tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 5460,
    "name": "Turmeric",
    "commonName": "Haldi",
    "botanicalName": "Curcuma longa",
    "about": "Turmeric is a herbaceous perennial plant that grows 3-5 feet tall, with large, oblong leaves that emerge from the base in an alternate arrangement, creating an attractive tropical appearance. The plant produces pale yellow flowers between bracts on dense spikes, though the primary value lies in the rhizomes growing underground. These rhizomes are the source of the famous yellow spice, with rough, brown skin and deep orange-yellow flesh that stains intensely. The plant grows from a central 'mother' rhizome that produces multiple smaller 'fingers,' similar to ginger but with a more uniform orange color throughout.\n\nOften called 'Indian saffron' for its vibrant color, turmeric has been used for over 4,000 years as a spice, medicine, dye, and cosmetic. The primary active compound, curcumin, gives turmeric its characteristic color and most of its medicinal properties, including powerful anti-inflammatory, antioxidant, and antimicrobial effects. In Ayurvedic medicine, turmeric is considered a balancing spice that supports joint health, digestion, and skin conditions, while in Hindu rituals it represents purity, prosperity, and fertility. Beyond culinary uses in curries and mustards, turmeric is used as a natural fabric dye, food coloring, and in skincare for its anti-inflammatory and brightening properties, though its staining power requires careful handling.",
    "care_instruction": "Mulch well, harvest after leaves dry.",
    "sunlight": "Partial Shade",
    "watering": "Regular",
    "soil": "Moist, organic-rich soil",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 6571,
    "name": "Onion",
    "commonName": "Onion",
    "botanicalName": "Allium cepa",
    "about": "Onions are biennial plants typically grown as annuals for their edible bulbs, featuring hollow, blue-green leaves and a shallow root system. The plants form bulbs through photoperiodism, with different varieties requiring specific day lengths to trigger bulbing: short-day types for southern regions, long-day for northern areas, and day-neutral for intermediate zones. The bulbs consist of layers of modified leaves (scales) that store nutrients, with papery outer skins in colors ranging from white and yellow to red and purple. If left to grow a second year, onions produce round clusters of white flowers on tall stalks that attract pollinators.\n\nOne of the oldest cultivated vegetables, onions have been grown for over 5,000 years and were valued by ancient civilizations for their culinary uses, medicinal properties, and even as currency. The characteristic pungent flavor and tear-inducing properties come from sulfur compounds released when cells are damaged, which also provide health benefits including antioxidant, anti-inflammatory, and antimicrobial effects. Onions are rich in vitamin C, B vitamins, potassium, and the prebiotic fiber inulin that supports gut health. They form the flavor base for countless dishes worldwide and can be stored for months when properly cured, making them valuable for year-round consumption in temperate climates.",
    "care_instruction": "Avoid overwatering, harvest when tops fall.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Loose, fertile soil",
    "climate": "Cool-season",
    "toxicity": "Toxic to pets"
  },
  {
    "plant_id": 7682,
    "name": "Potato",
    "commonName": "Potato",
    "botanicalName": "Solanum tuberosum",
    "about": "Potatoes are herbaceous perennials grown as annuals for their starchy tubers, with compound leaves divided into oval leaflets and small white, pink, or purple flowers that may develop into green, tomato-like fruits containing toxic seeds. The plants grow 1-2 feet tall and produce underground stems called stolons that swell at the tips to form the edible tubers we know as potatoes. These tubers are actually enlarged stem tissue containing eyes (buds) that can grow into new plants, serving as the plant's method of vegetative reproduction. Potato varieties exhibit enormous diversity in skin color (white, yellow, red, purple, blue), flesh color, shape, and cooking qualities.\n\nThe world's fourth largest food crop after maize, wheat, and rice, potatoes are incredibly efficient at producing food energy per unit of land and time. They are rich in carbohydrates, vitamin C, potassium, and vitamin B6, with the nutrients concentrated near the skin, making unpeeled potatoes more nutritious. Potatoes were first domesticated in the Andes Mountains of South America over 7,000 years ago and were introduced to Europe in the 16th century, eventually becoming a staple food that supported population growth. Different varieties are suited to specific culinary uses: waxy types for boiling and salads, floury types for baking and mashing, and all-purpose varieties that work well in most applications.",
    "care_instruction": "Hill soil around stems, prevent fungal rot.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Loose sandy soil",
    "climate": "Cool-season",
    "toxicity": "Leaves and unripe tubers toxic"
  },
  {
    "plant_id": 8793,
    "name": "Brinjal",
    "commonName": "Eggplant",
    "botanicalName": "Solanum melongena",
    "about": "Eggplant is a tender perennial typically grown as an annual, with large, coarse, lobed leaves that are often spiny and gray-green hairy stems that can become woody. The plants grow 2-4 feet tall and produce attractive violet flowers with yellow centers that develop into the characteristic fruits. Eggplants exhibit remarkable diversity in fruit shape (oval, elongated, round), size (from tiny pea-sized to over a foot long), and color (deep purple, white, green, striped, or orange). The fruits are technically berries containing numerous small, edible seeds embedded in the flesh, with a spongy texture that readily absorbs oils and flavors during cooking.\n\nOriginally domesticated in Southeast Asia, eggplants have been cultivated for over 4,000 years and feature prominently in cuisines from the Mediterranean to Asia. The name 'eggplant' comes from early white-fruited varieties that resembled goose eggs, while 'aubergine' is used in British English and 'brinjal' in South Asian and South African English. Eggplants are low in calories but rich in fiber, antioxidants, and nasunin (in purple varieties), a potent antioxidant that protects brain cells and has anti-aging properties. The fruits contain solanine like other nightshades, but levels are minimal in commercially grown varieties and further reduced by cooking, making them safe for consumption.",
    "care_instruction": "Stake plants, remove pests frequently.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Fertile loamy soil",
    "climate": "Warm-season",
    "toxicity": "Leaves toxic"
  },
  {
    "plant_id": 9804,
    "name": "Cauliflower",
    "commonName": "Cauliflower",
    "botanicalName": "Brassica oleracea var. botrytis",
    "about": "Cauliflower is a cool-season biennial grown as an annual for its edible flower head called a 'curd,' which consists of underdeveloped flower buds attached to a central stalk. The plant features large, thick, blue-green leaves that grow in a rosette formation, with some varieties having leaves that naturally curl over the developing curd to protect it from sunlight (self-blanching types). The curd can be white, orange, green, or purple depending on the variety, with color determined by pigments and exposure to sunlight. Cauliflower requires consistent cool temperatures to form tight, compact curds, as heat stress can cause loose, ricey texture or premature flowering.\n\nWhite cauliflower varieties require blanching (covering the curd) to prevent sunlight from turning them yellow and developing a stronger flavor, while colored varieties contain natural pigments that make blanching unnecessary. Orange cauliflower contains beta-carotene like carrots, purple varieties get their color from anthocyanins, and green cauliflower (sometimes called broccoflower) has chlorophyll in the curd. All types are rich in vitamin C, vitamin K, folate, and contain glucosinolates and isothiocyanates that have demonstrated anti-cancer properties in research. Cauliflower has gained popularity as a low-carb alternative to grains and potatoes, being riced, mashed, or used to make pizza crusts and other innovative dishes for health-conscious consumers.",
    "care_instruction": "Protect from heat, maintain cool soil.",
    "sunlight": "Full Sun",
    "watering": "Frequent",
    "soil": "Moist, fertile soil",
    "climate": "Cool-season",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 1915,
    "name": "Cabbage",
    "commonName": "Cabbage",
    "botanicalName": "Brassica oleracea var. capitata",
    "about": "Cabbage is a cool-season biennial grown as an annual for its dense-leaved heads, which form through a process called 'heading' where the inner leaves continue growing while the outer leaves slow their expansion. The plants feature large, fleshy leaves with prominent veins and a waxy coating that helps reduce water loss, growing in a compact rosette that develops into the characteristic rounded or conical head. Cabbage varieties come in different colors (green, red, white) and leaf textures (smooth or savoyed), with head sizes ranging from 1 to 8 pounds depending on growing conditions and variety. If left to grow a second year, cabbage produces tall flower stalks with yellow flowers that develop into seed pods.\n\nOne of the oldest cultivated vegetables, cabbage has been grown for over 4,000 years and was valued by ancient civilizations for its storage ability and medicinal properties. It is exceptionally rich in vitamin K, vitamin C, and glucosinolates that break down into compounds with demonstrated anti-cancer effects. The red pigment in red cabbage comes from anthocyanins, powerful antioxidants that also function as pH indicators, turning blue in basic conditions and red in acidic environments. Cabbage is the foundation of various fermented foods like sauerkraut and kimchi, where beneficial bacteria enhance its nutritional profile and digestibility while creating unique flavors prized in different culinary traditions.",
    "care_instruction": "Check for caterpillars, mulch heavily.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Rich, moist soil",
    "climate": "Cool-season",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 2826,
    "name": "Bottle Gourd",
    "commonName": "Lauki",
    "botanicalName": "Lagenaria siceraria",
    "about": "Bottle Gourd is a vigorous, fast-growing annual vine that can spread 15-30 feet, with large, heart-shaped leaves covered in soft hairs and tendrils that help it climb supports. The plant produces attractive white flowers that open in the evening and are pollinated by moths, developing into smooth, green fruits that can grow up to 3 feet long in various shapes from cylindrical to bulbous. Young fruits have tender, white flesh and edible skin, while mature fruits develop hard, waterproof shells as the flesh dries out and the seeds rattle inside. The vines grow rapidly in warm weather and can produce multiple fruits over an extended harvesting period.\n\nOne of the first cultivated plants, bottle gourds have been grown for over 10,000 years primarily for their mature dried shells rather than as a food crop. The lightweight, buoyant, waterproof shells have been used worldwide as containers, utensils, musical instruments, fishing floats, and even as protective cases for delicate items. As a vegetable, young bottle gourds are low in calories but rich in fiber, vitamin C, and minerals, with a mild flavor that readily absorbs spices in cooking. In traditional medicine, bottle gourd juice is used to manage weight, support heart health, and treat urinary problems, while the dried shells continue to be used in crafts and as natural containers in many cultures.",
    "care_instruction": "Provide trellis, fertilize weekly.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Fertile, well-drained",
    "climate": "Warm-season",
    "toxicity": "Bitter gourds are toxic"
  },
  {
    "plant_id": 3737,
    "name": "Bitter Gourd",
    "commonName": "Karela",
    "botanicalName": "Momordica charantia",
    "about": "Bitter Gourd is a fast-growing tropical vine with slender stems, lobed leaves similar to grape leaves, and tendrils that enable it to climb supports up to 10-15 feet high. The plant produces separate male and female yellow flowers that develop into distinctive warty fruits with a bumpy, textured surface that ranges from light to dark green. The fruits are typically harvested when 4-6 inches long, as they become increasingly bitter and develop a hollow center with red arils around the seeds as they mature. All parts of the plant have a strong bitter taste due to compounds called momordicins, which are most concentrated in the fruits.\n\nDespite its challenging flavor, bitter gourd is highly valued in traditional cuisines and medicine systems across Asia, Africa, and the Caribbean. It is exceptionally rich in vitamin C, vitamin A, folate, and antioxidants, while also containing compounds that have demonstrated anti-diabetic properties by helping regulate blood sugar levels. The bitterness can be reduced by salting and rinsing the sliced fruits before cooking, or by pairing them with strong spices and other ingredients that balance the flavor. In traditional medicine, bitter gourd is used to treat diabetes, digestive issues, skin conditions, and respiratory problems, with modern research confirming many of these therapeutic applications, particularly for blood sugar management.",
    "care_instruction": "Provide climbing support, remove old leaves.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Loamy soil",
    "climate": "Warm-season",
    "toxicity": "Seeds toxic if eaten raw"
  },
  {
    "plant_id": 4648,
    "name": "Okra",
    "commonName": "Lady's Finger",
    "botanicalName": "Abelmoschus esculentus",
    "about": "Okra is a warm-season annual that grows as an erect, branching plant reaching 4-6 feet tall, with large, lobed leaves similar to maple leaves and attractive hibiscus-like flowers that are pale yellow with dark red or purple centers. The flowers develop into the characteristic elongated, ribbed seed pods that are harvested when young and tender, typically 2-4 inches long. The pods contain numerous round seeds in a mucilaginous substance that gives okra its characteristic slimy texture when cooked, which is valued as a natural thickener in soups and stews. Okra plants continue producing pods throughout the growing season when regularly harvested, with each plant capable of yielding dozens of pods.\n\nOriginally from Africa, okra was brought to the Americas through the transatlantic slave trade and has become integral to Southern American, Caribbean, Indian, Middle Eastern, and West African cuisines. The mucilage that causes the slippery texture is a soluble fiber that aids digestion, helps lower cholesterol, and stabilizes blood sugar levels. Okra is rich in vitamin C, vitamin K, folate, and antioxidants, while the seeds contain quality protein and oil. The plants are relatively drought-tolerant and can produce in poor soils, making them valuable crops in challenging growing conditions. Young okra leaves are also edible and can be cooked like spinach or added to salads for additional nutrition.",
    "care_instruction": "Harvest young pods, fertilize every 15 days.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Well-drained soil",
    "climate": "Warm-season",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 5559,
    "name": "Beetroot",
    "commonName": "Beetroot",
    "botanicalName": "Beta vulgaris",
    "about": "Beetroot is a cool-season biennial grown as an annual for its swollen taproots, with glossy, dark green leaves often with red or purple veins that grow in a rosette formation. The roots can be spherical, cylindrical, or flattened in shape, with skin colors ranging from deep red and golden yellow to white and candy-striped, while the flesh shows concentric rings of color when cut crosswise. Both the roots and leaves are edible and highly nutritious, with the leaves resembling Swiss chard (to which they are closely related). If left to grow a second year, beetroot produces tall flower stalks with clusters of small green flowers that develop into seed balls containing multiple seeds.\n\nThe vibrant red color comes from betalain pigments, particularly betacyanin, which have powerful antioxidant and anti-inflammatory properties and are used as natural food colorings. Beetroots are rich in folate, manganese, potassium, iron, and dietary fiber, while also containing nitrates that can improve blood flow and lower blood pressure. The leaves are even more nutrient-dense than the roots, containing high levels of vitamin K, vitamin A, vitamin C, and calcium. Beetroots have been cultivated since ancient times, originally for their leaves rather than their roots, and have gained recent popularity as a 'superfood' for athletes due to their potential to enhance endurance and performance through improved oxygen utilization.",
    "care_instruction": "Thin seedlings early, keep soil moist.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Loamy, loose soil",
    "climate": "Cool to warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 6470,
    "name": "Peas",
    "commonName": "Green Peas",
    "botanicalName": "Pisum sativum",
    "about": "Peas are cool-season annual legumes that grow as bushy or vining plants, with compound leaves featuring 1-3 pairs of leaflets and terminal tendrils that help climbing varieties support themselves. The plants produce white, pink, or purple flowers that develop into pods containing 4-10 seeds (peas), with different varieties cultivated for fresh peas (garden peas), edible pods (snow peas and snap peas), or dried peas (field peas). Pea plants have a symbiotic relationship with nitrogen-fixing bacteria (Rhizobium) that form nodules on their roots, enabling them to convert atmospheric nitrogen into a usable form that enriches the soil. This characteristic makes them valuable in crop rotation systems for improving soil fertility.\n\nPeas are one of the oldest cultivated crops, with evidence of domestication dating back over 8,000 years in the Middle East, and were the plant used by Gregor Mendel in his pioneering genetics experiments. They are rich in protein, dietary fiber, vitamin C, vitamin K, B vitamins, and various minerals, while being relatively low in calories. The different types serve various culinary purposes: garden peas are shelled for the fresh seeds, snow peas are eaten whole when flat with underdeveloped seeds, and snap peas have edible pods with fully developed seeds. Peas lose sweetness quickly after harvesting as sugars convert to starch, making fresh-picked peas from the garden notably sweeter than store-bought ones.",
    "care_instruction": "Provide support, water consistently.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Well-drained fertile soil",
    "climate": "Cool-season",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 7381,
    "name": "Lavender",
    "commonName": "Lavender",
    "botanicalName": "Lavandula angustifolia",
    "about": "Lavender is a small, aromatic evergreen shrub that grows 1-3 feet tall and wide, with narrow, silvery-green leaves covered in fine hairs that help reduce water loss. The plant produces iconic flower spikes in shades of purple, pink, or white on long, slender stems above the foliage, with individual flowers arranged in whorls around the spike. The entire plant is highly aromatic due to essential oils contained in glandular hairs on the leaves, stems, and flowers, which are released when brushed against or crushed. Lavender has a woody base and becomes increasingly woody with age, requiring periodic pruning to maintain compact growth and productivity.\n\nRenowned for its calming fragrance, lavender has been used for over 2,500 years for perfumery, medicine, and culinary purposes, with the ancient Romans using it in bathing rituals (the name comes from Latin 'lavare' meaning 'to wash'). The essential oil contains compounds like linalool and linalyl acetate that have demonstrated sedative, anti-anxiety, and pain-relieving properties in scientific studies. Lavender is drought-tolerant once established and thrives in well-drained, alkaline soils with full sun, making it ideal for Mediterranean-style gardens. Beyond its ornamental and aromatic uses, lavender flowers are edible and used to flavor honey, sugar, teas, and baked goods, while the dried flowers maintain their fragrance for years in sachets and potpourri.",
    "care_instruction": "Avoid humidity, prune after flowering.",
    "sunlight": "Full Sun",
    "watering": "Low; drought-tolerant",
    "soil": "Sandy, well-drained soil",
    "climate": "Dry temperate",
    "toxicity": "Mildly toxic to pets"
  },
  {
    "plant_id": 8292,
    "name": "Jasmine",
    "commonName": "Jasmine",
    "botanicalName": "Jasminum sambac",
    "about": "Jasmine is a tropical evergreen shrub or vine that can grow 3-10 feet tall, with glossy, dark green leaves arranged in opposite pairs along the stems. The plant produces intensely fragrant white flowers that typically open in the evening, with some varieties like Arabian Jasmine (Jasminum sambac) featuring double flowers that resemble small roses. Jasmine flowers are often star-shaped with a tubular base, growing in clusters of 3-12 blossoms that contrast beautifully against the dark foliage. While some jasmine species are true climbers with twining stems, others are shrubs that can be trained on supports or grown as free-standing plants.\n\nIn many cultures, jasmine symbolizes love, beauty, and purity, with the flowers used extensively in religious ceremonies, weddings, and festivals. The fragrance is extracted through enfleurage or solvent extraction to produce jasmine absolute, one of the most valuable materials in perfumery due to its rich, complex scent that can't be fully replicated synthetically. Jasmine tea is created by scenting tea leaves with fresh jasmine flowers, a process developed in China over 1,000 years ago that remains popular today. In traditional medicine, jasmine is used to reduce stress, lift depression, and aid digestion, while the essential oil is valued in aromatherapy for its calming yet uplifting effects on mood and emotions.",
    "care_instruction": "Prune regularly, fertilize during bloom.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Fertile soil",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 9103,
    "name": "Hibiscus",
    "commonName": "Hibiscus",
    "botanicalName": "Hibiscus rosa-sinensis",
    "about": "Hibiscus is a tropical evergreen shrub that typically grows 4-10 feet tall, with glossy, dark green leaves that are oval with serrated edges and often have a slightly waxy texture. The plant produces spectacular flowers up to 6-8 inches across in vibrant colors including red, pink, orange, yellow, and white, with a prominent central staminal column that extends beyond the petals. Each flower lasts only 1-2 days, but the plant produces new blooms continuously throughout the warm season in ideal conditions. Hibiscus flowers exhibit complete hibiscus form with five overlapping petals, though double-flowered varieties with extra petaloids are also popular.\n\nAs the national flower of Malaysia and the state flower of Hawaii, hibiscus holds significant cultural importance in many tropical regions, symbolizing delicate beauty and hospitality. The flowers are edible and used to add color and mild flavor to salads, teas, and garnishes, while also being rich in antioxidants and vitamin C. Hibiscus sabdariffa (Roselle) is a different species whose calyces are used to make hibiscus tea, known for its tart, cranberry-like flavor and potential blood pressure-lowering effects. In traditional medicine, hibiscus preparations are used to treat hair loss, skin conditions, fever, and high blood pressure, with modern research supporting some of these applications, particularly for cardiovascular health.",
    "care_instruction": "Fertilize weekly, prune to shape.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Loamy soil",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 1014,
    "name": "Bougainvillea",
    "commonName": "Bougainvillea",
    "botanicalName": "Bougainvillea glabra",
    "about": "Bougainvillea is a vigorous, thorny, woody vine or shrub that can climb up to 40 feet with support, featuring oval, bright green leaves and sharp spines at the leaf axils. The plant's spectacular color comes not from its small, inconspicuous white or yellow true flowers, but from the papery, leaf-like bracts that surround them in vibrant shades of magenta, purple, red, orange, pink, yellow, or white. These bracts persist for weeks, creating a long-lasting display that makes bougainvillea one of the most colorful tropical plants. The plants are drought-tolerant once established and flower most profusely when slightly stressed, making them ideal for hot, dry locations.\n\nNative to South America, bougainvillea was discovered by French botanist Philibert Commerson during a voyage led by Admiral Louis Antoine de Bougainville, after whom the plant is named. The plants are incredibly versatile in landscaping, used as ground covers, container plants, hedges, or trained to climb walls, fences, and trellises, with some varieties capable of covering entire buildings. Bougainvillea's thorny nature makes it useful as a security barrier, while its salt tolerance enables it to thrive in coastal gardens. The plants can be trained as standards (tree forms) or bonsai, and in frost-free climates, they can live for decades, developing thick, gnarled trunks that add structural interest even when not in flower.",
    "care_instruction": "Avoid overwatering, prune aggressively.",
    "sunlight": "Full Sun",
    "watering": "Low",
    "soil": "Sandy soil",
    "climate": "Warm dry",
    "toxicity": "Thorns may irritate skin"
  },
  {
    "plant_id": 2125,
    "name": "Pothos Marble Queen",
    "commonName": "Marble Queen Pothos",
    "botanicalName": "Epipremnum aureum 'Marble Queen'",
    "about": "Marble Queen Pothos is a striking cultivar of the common Pothos, distinguished by its heavily variegated leaves featuring creamy white and green marbling that can cover up to 80% of the leaf surface. The heart-shaped leaves grow alternately along trailing stems that can reach 6-10 feet long indoors, with new leaves emerging solid white or pale green and developing more variegation as they mature. Like other pothos varieties, this plant can grow in soil or water and develops aerial roots along the stems that help it cling to supports or absorb moisture from the air. The variegation pattern is unstable, meaning reverting to mostly green leaves can occur if light conditions are insufficient.\n\nThis popular houseplant is particularly valued for its ability to brighten dim corners with its dramatic foliage, though it requires more light than solid green varieties to maintain its variegation. The extensive white areas contain less chlorophyll, making photosynthesis less efficient and necessitating brighter indirect light to support healthy growth. Marble Queen Pothos shares the same air-purifying capabilities as other pothos varieties, effectively removing common indoor pollutants like formaldehyde, benzene, and xylene. While generally low-maintenance, it grows more slowly than greener varieties due to reduced chlorophyll, and may benefit from occasional fertilization to support its striking appearance without overwhelming the plant with growth-stimulating nitrogen.",
    "care_instruction": "Mist occasionally, trim vines.",
    "sunlight": "Low to Medium Light",
    "watering": "Once a week",
    "soil": "Well-drained mix",
    "climate": "Indoor",
    "toxicity": "Toxic to pets"
  },
  {
    "plant_id": 3236,
    "name": "ZZ Plant",
    "commonName": "ZZ Plant",
    "botanicalName": "Zamioculcas zamiifolia",
    "about": "The ZZ Plant is an exceptionally tough tropical perennial characterized by its glossy, dark green pinnate leaves that grow upright on graceful, arching stems from thick, potato-like rhizomes. Each leaf consists of 6-8 pairs of leathery, oval leaflets arranged alternately along the central stem, creating a feather-like appearance that gives the plant its elegant, architectural quality. The rhizomes store water, enabling the plant to survive months of drought, while the waxy leaf coating helps reduce water loss, making it ideally adapted to low-humidity indoor environments. Mature plants may produce small, spathe-type flowers similar to peace lilies at the base, though flowering is rare indoors.\n\nOften called the 'eternity plant' for its remarkable durability, the ZZ Plant can survive in conditions that would kill most other houseplants, including very low light, irregular watering, and neglect. This resilience comes from its efficient water storage and slow growth habit, which conserves energy and resources in challenging conditions. The plant has gained popularity in office environments and low-light homes where other plants struggle, though it grows fastest and produces the most new stems in bright indirect light. Despite its tough reputation, the ZZ Plant is surprisingly elegant, with its shiny leaves reflecting light to brighten dark spaces, making it both functional and decorative for modern interiors.",
    "care_instruction": "Avoid overwatering, clean leaves monthly.",
    "sunlight": "Low Light",
    "watering": "Every 2–3 weeks",
    "soil": "Well-drained soil",
    "climate": "Indoor, dry air",
    "toxicity": "Toxic if ingested"
  },
  {
    "plant_id": 4347,
    "name": "Peace Lily",
    "commonName": "Peace Lily",
    "botanicalName": "Spathiphyllum wallisii",
    "about": "Peace Lily is a popular tropical evergreen perennial valued for its glossy, dark green leaves and elegant white flowers that rise above the foliage on slender stalks. The plant grows in clumps from underground rhizomes, with leaves emerging directly from the soil on individual petioles and arching gracefully outward. The distinctive 'flowers' are actually specialized leaf bracts called spathes that surround the true flowers (the spadix), with the spathes starting pure white and gradually turning green as they age. Peace Lilies are relatively compact, typically growing 1-4 feet tall depending on the variety, with dwarf forms suitable for small spaces and larger varieties making dramatic floor plants.\n\nNASA's Clean Air Study identified Peace Lilies as excellent air purifiers that remove multiple volatile organic compounds including formaldehyde, benzene, and trichloroethylene from indoor environments. The plants are also known for their dramatic response to underwatering, with leaves drooping noticeably when thirsty but quickly recovering after watering, making them excellent indicators of when attention is needed. While often recommended for low-light conditions, Peace Lilies actually prefer bright indirect light to flower reliably, though they will survive in lower light with reduced flowering. The plants appreciate high humidity and can be grown in water culture, making them versatile for various indoor growing situations beyond traditional potting soil.",
    "care_instruction": "Mist leaves, avoid direct sun.",
    "sunlight": "Low to Medium Indirect",
    "watering": "Keep soil moist",
    "soil": "Rich potting soil",
    "climate": "Indoor",
    "toxicity": "Toxic to pets"
  },
  {
    "plant_id": 5458,
    "name": "Areca Nut Palm",
    "commonName": "Betel Nut Palm",
    "botanicalName": "Areca catechu",
    "about": "The Areca Nut Palm is a slender, single-stemmed palm that can reach 50-60 feet tall in ideal conditions, with a graceful crown of 8-12 arching, pinnate leaves that grow 4-6 feet long. The trunk is green when young, turning gray with prominent ring-like leaf scars as it matures, and the plant produces large branched inflorescences that emerge from below the leaves. These develop into clusters of orange-red fruits each containing a single seed (the areca nut), with a single mature tree capable of producing several hundred fruits annually. The palm is fast-growing in tropical conditions, beginning to fruit within 5-7 years of planting and remaining productive for several decades.\n\nThis palm is cultivated throughout tropical Asia primarily for its seeds, which are chewed with betel leaves and slaked lime as a mild stimulant known as betel quid or paan. The practice dates back thousands of years and remains culturally significant in many Asian communities, despite health concerns linked to regular use. The nuts contain arecoline, a psychoactive compound that produces mild euphoria and increased alertness, but also has carcinogenic properties when combined with lime. Beyond its stimulant use, the palm has various traditional applications: the wood is used for construction, the leaves for thatching, and different plant parts feature in traditional medicine systems for treating digestive issues, parasites, and respiratory conditions.",
    "care_instruction": "Water regularly, avoid strong winds, add compost.",
    "sunlight": "Full Sun to Partial Shade",
    "watering": "Moderate",
    "soil": "Moist, well-drained soil",
    "climate": "Tropical",
    "toxicity": "Fruits mildly toxic if consumed raw"
  },
  {
    "plant_id": 6569,
    "name": "Ashwagandha",
    "commonName": "Indian Ginseng",
    "botanicalName": "Withania somnifera",
    "about": "Ashwagandha is a small, woody shrub that grows 1-2 feet tall, with oval leaves covered in fine gray hairs and small, greenish-yellow bell-shaped flowers that develop into orange-red berries enclosed in papery calyxes. The plant has a stout, fleshy taproot that is the primary medicinal part, with roots growing up to 1 foot long and developing a characteristic horse-like odor (the name 'ashwagandha' means 'smell of a horse' in Sanskrit). All parts of the plant are covered in star-shaped trichomes (hairs) that give it a velvety texture, and the branches spread widely to form a rounded shrub. Ashwagandha is relatively drought-tolerant and thrives in dry, stony soils with full sun, making it well-adapted to semi-arid regions.\n\nConsidered one of the most important herbs in Ayurvedic medicine, Ashwagandha has been used for over 3,000 years as a rasayana (rejuvenator) to promote vitality, longevity, and overall health. The roots contain withanolides, steroidal lactones that have adaptogenic properties, helping the body resist physical, chemical, and biological stressors. Modern research supports its traditional uses for reducing stress and anxiety, improving sleep, enhancing cognitive function, and supporting immune health. Unlike many medicinal herbs, Ashwagandha roots are typically harvested after the first year of growth when withanolide concentrations peak, with the dried roots powdered for use in capsules, teas, or traditional preparations like ghee-based medicated oils.",
    "care_instruction": "Low maintenance, prefers dry soil.",
    "sunlight": "Full Sun",
    "watering": "Low",
    "soil": "Sandy, well-drained",
    "climate": "Dry tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 7680,
    "name": "Amla",
    "commonName": "Indian Gooseberry",
    "botanicalName": "Phyllanthus emblica",
    "about": "Amla is a small to medium-sized deciduous tree that grows 15-30 feet tall, with feathery, light green leaves that are actually modified branchlets with numerous small leaflets giving them a pinnate appearance. The bark is smooth and gray, flaking off in thin patches, while the greenish-yellow flowers are inconspicuous and appear in clusters along the branches. The fruits are round, smooth, and pale green with six vertical stripes, containing a single hard stone surrounded by crisp, juicy flesh that is exceptionally sour and astringent when fresh. Amla trees are remarkably resilient, tolerating drought, poor soils, and some salinity, while beginning to fruit within 7-8 years of planting.\n\nWidely regarded as one of the most important medicinal plants in Ayurveda, Amla is considered a rasayana that promotes longevity and rejuvenation throughout the body. The fruits are extraordinarily rich in vitamin C, with content 20 times higher than oranges, and this vitamin C is remarkably stable due to the presence of tannins that prevent oxidation even when heated or dried. Amla also contains various antioxidants, flavonoids, and minerals that contribute to its health benefits, which include supporting immune function, improving digestion, enhancing hair and skin health, and helping regulate blood sugar. The fruits are rarely eaten fresh due to their extreme sourness but are processed into candies, pickles, juices, and dried powders that preserve their nutritional benefits while making them palatable.",
    "care_instruction": "Minimal pruning, drought tolerant.",
    "sunlight": "Full Sun",
    "watering": "Low to moderate",
    "soil": "Loamy soil",
    "climate": "Tropical to subtropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 4345,
    "name": "Zinnia",
    "commonName": "Zinnia",
    "botanicalName": "Zinnia elegans",
    "about": "Zinnias are cheerful annual flowers known for their vibrant, daisy-like blooms that come in almost every color except blue, with forms ranging from single petals to fully double pom-poms. The plants feature upright, hairy stems with opposite, lance-shaped leaves that are rough to the touch, growing 1-3 feet tall depending on the variety. The flower heads can be small button types just an inch across or large dahlia-flowered types reaching 6 inches in diameter, with colors including red, pink, orange, yellow, white, purple, and green. Zinnias are among the easiest annuals to grow from seed and bloom prolifically from early summer until the first frost, making them valuable for continuous color in gardens.\n\nThese heat-loving plants are particularly valued for their ability to thrive in hot, dry conditions where other flowers might struggle, and they're excellent for cutting gardens as they maintain their vibrant colors and form well in arrangements. Zinnias are important pollinator plants, attracting butterflies, bees, and hummingbirds to the garden throughout the growing season. The flowers are also edible and can be used to add color to salads and desserts, though they're primarily grown for ornamental purposes. Modern breeding has produced disease-resistant varieties that overcome the powdery mildew issues that sometimes affected older types, making them more reliable for home gardeners and commercial growers alike.",
    "care_instruction": "Avoid overhead watering, remove wilted blooms.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Well-drained",
    "climate": "Warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 5456,
    "name": "Dahlia",
    "commonName": "Dahlia",
    "botanicalName": "Dahlia pinnata",
    "about": "Dahlias are tuberous perennial plants renowned for their spectacular, intricate flowers that range from tiny pom-poms less than 2 inches across to giant dinnerplate varieties exceeding 10 inches in diameter. The plants grow from clusters of tuberous roots, with hollow stems that can reach from 1 to 6 feet tall depending on the variety, and dark green, pinnate leaves that provide an attractive backdrop to the flowers. Dahlia blooms come in an incredible array of forms including single, anemone, collarette, waterlily, decorative, ball, and cactus types, in virtually every color except true blue. The flowering season extends from midsummer until the first frost, with plants producing new blooms continuously when deadheaded regularly.\n\nOriginally from Mexico and Central America, dahlias were cultivated by the Aztecs for food, medicine, and ceremonial purposes before being introduced to Europe in the 18th century. Today, they are grown exclusively for their ornamental value and are particularly prized by cut flower growers for their long vase life and dramatic appearance. Dahlia tubers must be lifted and stored indoors in regions with freezing winters, then replanted each spring after the danger of frost has passed. The plants are heavy feeders that benefit from regular fertilization and consistent moisture, rewarding careful cultivation with one of the most spectacular floral displays in the gardening world.",
    "care_instruction": "Stake tall varieties, fertilize often.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Rich, well-drained",
    "climate": "Temperate",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 6567,
    "name": "Lotus",
    "commonName": "Lotus",
    "botanicalName": "Nelumbo nucifera",
    "about": "The Lotus is an aquatic perennial plant that grows in shallow water, featuring spectacular large, round leaves that float on the water surface or rise above it on sturdy stalks, and breathtaking flowers that emerge from the water on separate stalks. The leaves are water-repellent due to a waxy coating and microscopic surface structures that cause water to bead up and roll off, taking dirt particles with them - a phenomenon known as the 'lotus effect.' The flowers are typically pink or white, with numerous petals arranged in concentric circles around a central cone-shaped receptacle that develops into the characteristic seed pod. Lotus plants grow from thick, creeping rhizomes that are embedded in the mud at the bottom of ponds or containers.\n\nConsidered sacred in Hinduism and Buddhism, the lotus symbolizes purity, enlightenment, and rebirth because it emerges clean and beautiful from muddy waters. The plant has enormous cultural significance throughout Asia, featuring in religious art, architecture, and literature for thousands of years. Every part of the plant is edible: the rhizomes are used as a vegetable in Asian cuisines, the seeds are eaten raw, roasted, or ground into flour, and the young leaves and flower stalks are prepared as greens. The seeds are remarkably long-lived, with some documented cases of lotus seeds germinating after being dormant for over 1,000 years, making them a symbol of longevity and resilience.",
    "care_instruction": "Grow in still water, fertilize monthly.",
    "sunlight": "Full Sun",
    "watering": "Aquatic plant; keep submerged",
    "soil": "Clay soil underwater",
    "climate": "Tropical, warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 7678,
    "name": "Water Lily",
    "commonName": "Water Lily",
    "botanicalName": "Nymphaea spp.",
    "about": "Water Lilies are aquatic plants that grow from submerged rhizomes, producing round, floating leaves with a distinctive slit and beautiful flowers that float on the water surface or rise slightly above it. The leaves are typically green, sometimes with variegation or reddish tones, and have a waxy coating that makes them water-repellent, with the undersides often purple or red. The flowers come in various colors including white, pink, red, yellow, blue, and purple, opening during the day for day-blooming varieties or at night for night-bloomers, with each flower lasting several days. Water lilies are divided into two main types: hardy varieties that survive freezing temperatures and tropical varieties that require warm water year-round.\n\nThese plants play crucial ecological roles in aquatic ecosystems, providing shade that reduces algae growth, oxygenating the water, and offering shelter for fish and other aquatic creatures. The flowers of many species emit fragrance to attract pollinators, primarily beetles and bees, and have a unique pollination mechanism where the flower closes at night, trapping insects inside until morning. Water lilies have inspired artists throughout history, most famously Claude Monet, who created hundreds of paintings of the water lily pond in his garden at Giverny. In garden ponds, they help maintain ecological balance while adding incredible beauty with their floating blooms and pads that create natural patterns on the water's surface.",
    "care_instruction": "Keep in calm water, divide tubers yearly.",
    "sunlight": "Full Sun",
    "watering": "Aquatic",
    "soil": "Clay soil underwater",
    "climate": "Tropical to temperate",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 8789,
    "name": "Bamboo",
    "commonName": "Bamboo Plant",
    "botanicalName": "Bambusoideae spp.",
    "about": "Bamboo is a group of fast-growing, woody-stemmed grasses that includes both clumping types that form discrete mounds and running types that spread aggressively by underground rhizomes. The plants feature hollow, jointed stems called culms that emerge from the ground at their full diameter and grow to their full height in a single growing season, with branches and leaves developing later. Bamboo leaves are typically lance-shaped and arranged alternately on the branches, while the culms can be green, yellow, black, or striped, with sizes ranging from miniature varieties just inches tall to giant timber bamboos reaching over 100 feet. Most bamboos flower infrequently, with some species flowering only once every several decades in synchronized events that affect entire populations.\n\nAs one of the fastest-growing plants on Earth, some bamboo species can grow up to 3 feet in 24 hours under ideal conditions, making them remarkable examples of plant growth potential. Bamboo has thousands of uses worldwide: as building material for houses, scaffolding, and furniture; as food source with young shoots consumed as vegetables; for making paper, textiles, and various household items; and as ornamental plants in gardens. Ecologically, bamboo forests provide important habitat for many species, including giant pandas that depend almost exclusively on bamboo for food. Bamboo's rapid growth and ability to sequester carbon make it valuable for environmental restoration and as a sustainable alternative to wood and plastic in many applications.",
    "care_instruction": "Provide root barrier, water regularly.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Moist soil",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 9800,
    "name": "Areca Bamboo",
    "commonName": "Golden Cane Palm",
    "botanicalName": "Dypsis lutescens",
    "about": "The Areca Bamboo Palm, commonly known as the Golden Cane Palm, is a clustering palm that features multiple slender, golden-yellow stems with prominent leaf scars that create a bamboo-like appearance. The plant produces arching, feather-like fronds with numerous narrow leaflets that give it a soft, graceful texture, growing 6-12 feet tall indoors but potentially reaching 20-30 feet in outdoor tropical settings. The stems are particularly attractive, starting green and developing their characteristic golden color as they mature, while the fronds remain bright green and create a lush, tropical canopy. Small yellow flowers may appear in summer, followed by tiny purple fruits, though indoor specimens rarely flower or fruit.\n\nThis palm is particularly valued for its air-purifying capabilities, effectively removing indoor air pollutants like formaldehyde, xylene, and toluene while adding humidity to dry indoor environments through transpiration. The clustering growth habit creates a full, bushy appearance that makes it excellent as a room divider or focal point in interior landscaping. Areca Palms are relatively fast-growing compared to other palms and can be divided when they become too large, making them economical choices for filling large spaces. While they prefer bright, indirect light, they can tolerate lower light conditions better than many other palm species, though growth will be slower and the characteristic golden coloration may be less pronounced.",
    "care_instruction": "Mist leaves, avoid direct harsh sun.",
    "sunlight": "Indirect to bright",
    "watering": "Moderate",
    "soil": "Rich, well-drained",
    "climate": "Tropical",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 1911,
    "name": "Sweet Basil",
    "commonName": "Basil",
    "botanicalName": "Ocimum basilicum",
    "about": "Sweet Basil is a tender annual herb known for its aromatic, bright green leaves that have a sweet, slightly peppery flavor with notes of anise and mint. The plant grows 1-2 feet tall with square stems characteristic of the mint family, opposite, oval leaves that can be smooth or slightly crinkled depending on the variety, and small white or pink flowers arranged in whorls on spike-like inflorescences. There are numerous basil varieties beyond the common sweet basil, including Genovese with larger leaves ideal for pesto, Thai basil with purple stems and licorice flavor, and various purple-leaved ornamental types. Basil is highly sensitive to cold temperatures and should only be planted outdoors after all danger of frost has passed in spring.\n\nAs a cornerstone of Mediterranean and Southeast Asian cuisines, basil is essential for dishes like Italian pesto, Caprese salad, Thai curries, and Vietnamese pho. The leaves are rich in essential oils including estragole, linalool, and eugenol, which contribute to both its distinctive aroma and its medicinal properties. In traditional medicine, basil has been used to aid digestion, reduce inflammation, and combat stress, while modern research has identified antioxidant and antimicrobial compounds in the essential oil. Basil plants should be pinched regularly to prevent flowering, which causes the leaves to become bitter and reduces leaf production, ensuring a continuous harvest throughout the growing season.",
    "care_instruction": "Pinch flower buds, fertilize lightly.",
    "sunlight": "Full Sun",
    "watering": "Regular",
    "soil": "Well-drained loam",
    "climate": "Warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 2822,
    "name": "Mint",
    "commonName": "Mint",
    "botanicalName": "Mentha spp.",
    "about": "Mint is a fast-spreading perennial herb known for its aromatic leaves and aggressive growth habit, with square stems and opposite leaves that contain menthol and other essential oils responsible for their characteristic cooling sensation. The plants typically grow 1-2 feet tall, with leaves ranging from bright green to variegated forms, and produce small flowers in spikes or whorls in shades of white, pink, or purple during summer. There are numerous mint varieties including peppermint with its strong menthol content, spearmint with a sweeter flavor, apple mint with fuzzy leaves and fruity scent, and chocolate mint with subtle chocolate undertones. Mint spreads vigorously by underground runners (stolons) that can quickly take over garden beds if not contained.\n\nOne of the world's most popular herbs, mint is used extensively in culinary applications from savory dishes like lamb and tabbouleh to beverages like mojitos and mint tea, to desserts like mint chocolate chip ice cream. The menthol in peppermint has analgesic and cooling properties that make it valuable in topical pain relief products, while peppermint tea is traditionally used to soothe digestive issues and relieve headaches. Mint plants are remarkably easy to grow and can become invasive, making them ideal for containers where their spreading habit can be controlled. The leaves can be used fresh or dried, though fresh leaves provide the best flavor and highest concentration of beneficial essential oils.",
    "care_instruction": "Grow in pots to control spread, water well.",
    "sunlight": "Partial Sun",
    "watering": "Regular",
    "soil": "Moist, rich soil",
    "climate": "Mild to warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 3733,
    "name": "Lemongrass",
    "commonName": "Lemongrass",
    "botanicalName": "Cymbopogon citratus",
    "about": "Lemongrass is a tropical, clump-forming perennial grass that grows in dense tufts 3-6 feet tall, with slender, blue-green leaves that have sharp edges and a strong lemon scent when bruised or cut. The plant features fibrous, bulbous bases that are pale yellow to white and contain the highest concentration of essential oils, while the leaves are tough and not typically eaten. Lemongrass produces large, plume-like flower heads on tall stalks when grown in tropical conditions, though it rarely flowers in temperate climates or when harvested regularly. The plants grow from divisions or from the basal portions of stalks sold in grocery stores, which can be rooted in water before planting.\n\nWidely used in Southeast Asian cuisines, particularly Thai, Vietnamese, and Indonesian cooking, lemongrass imparts a bright, citrusy flavor to soups, curries, stir-fries, and teas without the acidity of actual lemons. The essential oil, rich in citral, is used in perfumes, cosmetics, and aromatherapy for its fresh, uplifting scent and purported insect-repelling properties. In traditional medicine, lemongrass tea is used to relieve anxiety, lower cholesterol, and aid digestion, while the oil has demonstrated antimicrobial and anti-inflammatory effects in scientific studies. Lemongrass plants are tender perennials that must be brought indoors or treated as annuals in frost-prone areas, though they can be easily overwintered indoors in pots.",
    "care_instruction": "Cut back regularly, fertilize lightly.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Sandy loam",
    "climate": "Warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 4644,
    "name": "Aster",
    "commonName": "Aster Flower",
    "botanicalName": "Aster amellus",
    "about": "Asters are herbaceous perennial plants known for their daisy-like flowers that bloom in late summer and fall, providing valuable color when many other garden plants have finished flowering. The plants feature erect, branching stems with lance-shaped leaves that are often rough to the touch, growing 1-6 feet tall depending on the variety. The flowers consist of central disc florets surrounded by ray florets, typically in shades of purple, blue, pink, or white, with yellow centers that darken as the flowers mature. Asters are particularly valuable for their extended blooming period, often flowering for 4-6 weeks or longer, and their ability to attract pollinators when few other nectar sources are available.\n\nThe name 'aster' comes from the Greek word for 'star,' referring to the star-like shape of the flowers, and these plants have long been associated with elegance and patience in the language of flowers. Asters are important late-season food sources for bees, butterflies, and other pollinators preparing for migration or winter, making them valuable additions to wildlife gardens. Modern breeding has produced compact, disease-resistant varieties that are easier to grow than older types, which were sometimes prone to powdery mildew. These plants are typically divided every 2-3 years to maintain vigor and prevent the centers from dying out, and they combine beautifully with other fall-blooming plants like chrysanthemums, ornamental grasses, and sedums.",
    "care_instruction": "Deadhead blooms, water regularly.",
    "sunlight": "Full Sun",
    "watering": "Moderate",
    "soil": "Well-drained",
    "climate": "Cool to warm",
    "toxicity": "Non-toxic"
  },
  {
    "plant_id": 5555,
    "name": "Begonia",
    "commonName": "Begonia",
    "botanicalName": "Begonia semperflorens",
    "about": "Begonias are a diverse group of plants including annuals, perennials, and shrubs grown for their attractive foliage and/or flowers, with wax begonias being particularly popular for their continuous blooming and tolerance of various conditions. The plants feature succulent stems and asymmetrical leaves that can be green, bronze, or variegated, with flowers in shades of white, pink, red, or orange that appear consistently throughout the growing season. Wax begonias form compact mounds 6-12 inches tall and wide, with glossy leaves that give them their common name and flowers that can be single or double. Other begonia types include tuberous begonias with large, showy flowers; rex begonias with spectacular foliage; and angel-wing begonias with spotted leaves and hanging flowers.\n\nBegonias are particularly valued for their ability to bloom in shade where many other flowering plants struggle, making them invaluable for brightening dark garden corners and north-facing containers. The plants are generally low-maintenance and resistant to pests, though they can be susceptible to powdery mildew in humid conditions with poor air circulation. Begonias have a long history of cultivation, with many modern hybrids derived from species discovered during Victorian plant-hunting expeditions to tropical regions. While typically grown as annuals in temperate climates, many begonia types can be overwintered indoors as houseplants or by storing tubers, allowing gardeners to preserve favorite varieties from year to year.",
    "care_instruction": "Avoid direct harsh sun, keep soil moist.",
    "sunlight": "Indirect Light",
    "watering": "Regular",
    "soil": "Loose soil",
    "climate": "Warm humid",
    "toxicity": "Mildly toxic"
  },
  {
    "plant_id": 6754,
    "name": "Orchid",
    "commonName": "Moth Orchid",
    "botanicalName": "Phalaenopsis spp.",
    "about": "Orchids are exquisite flowering plants known for their elegant, long-lasting blooms and diverse growth habits. The most common variety, the Moth Orchid, features broad, fleshy leaves that store water and roots that often grow outside the potting medium to absorb moisture from the air. The flowers appear on arching spikes and can last for several months, coming in countless colors and patterns from pure white to deep purple with intricate markings. These epiphytic plants naturally grow on trees in tropical forests rather than in soil, which explains their unique growing requirements and aerial root systems.",
    "care_instruction": "Water when roots turn silver, provide high humidity, avoid direct sun.",
    "sunlight": "Bright Indirect",
    "watering": "Once a week; mist aerial roots",
    "soil": "Orchid bark mix",
    "climate": "Tropical, humid",
    "toxicity": "Non-toxic"
  }
]